In [2]:
import pandas as pd
import numpy as np
import scipy as sp

In [3]:
stud_perf=pd.read_csv(r'C:\Users\user\Downloads\StudentsPerformance.csv')

In [30]:
stud_perf.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

### Find out how many males and females participated in the test

In [5]:
stud_perf.value_counts('gender')

gender
female    518
male      482
dtype: int64

### What do you think about the students' parental level of education?

In [6]:
stud_perf.value_counts('parental level of education')

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
dtype: int64

Most parents have some college education while only a few have a master's degree

### Who scores the most on average for math, reading and writing

In [8]:
stud_perf.groupby('gender')[['math score','reading score','writing score']].mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

Female scored most on reading and writing while male scored most on maths

In [10]:
stud_perf.groupby('test preparation course')[['math score','reading score','writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

people who prepared for test scored higher than those who did no course

### What do you think about the scoring variation for math, reading and writing

In [11]:
stud_perf.groupby('gender')[['math score','reading score','writing score']].std()

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

for maths the variation is high whereas for reading and writing the variation is less

In [13]:
stud_perf.groupby('test preparation course')[['math score','reading score','writing score']].std()

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

The variation is high for those who did not attend any test prepration course

### The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [29]:
stud_perf.quantile(q=0.75)

math score       77.00
reading score    79.25
writing score    79.00
Name: 0.75, dtype: float64

In [31]:
stud_perf[stud_perf['math score']>77]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
430,female,group A,some college,standard,completed,78,87,91
431,female,group B,bachelor's degree,free/reduced,none,78,79,76
432,female,group D,bachelor's degree,standard,none,78,82,79
433,female,group D,high school,standard,none,78,81,80
434,female,group D,bachelor's degree,free/reduced,none,78,90,93
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100